app/controllers/movies_controller.rb

  def edit
    puts params
    @movie = Movie.find params[:id]
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 12]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2017-07-23 00:00:00.000000"], ["updated_at", "2022-10-23 06:39:31.897116"], ["id", 16]]